In [3]:
# Assignment 23
"""
Question:
Predicting Survival in the Titanic Data Set
We will be using a decision tree to make predictions about the Titanic data set from
Kaggle. This data set provides information on the Titanic passengers and can be used to
predict whether a passenger survived or not.
"""

#Code to loading data and modules
import numpy as np # importing numpy lib useful for array manipultaion
import pandas as pd # importing pandas which is built on top of numpy
import seaborn as sb # importing seaborn library good for visualization purpose
import matplotlib.pyplot as plt # importing matplotlib.pyplot for visualization
import sklearn # importing sklearn the best ML library
from pylab import rcParams
from sklearn import preprocessing
from sklearn.linear_model import LogisticRegression # importing logistic regression
from sklearn.model_selection import train_test_split # this library is good for dividong data into train test split
from sklearn import metrics # importing metrics library which is good for checking performance of model
from sklearn.metrics import classification_report # importing classification_report which gives params report

In [43]:
url= 'https://raw.githubusercontent.com/BigDataGal/Python-for-Data-Science/master/titanic-train.csv' # url of location of the csv file
titanic_df = pd.read_csv(url) # reading the csv file
titanic_df.head() # printing top 5 rows of the data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [44]:
titanic_df.columns # printing the columns of the dataframe titanic_df

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [45]:
titanic_df.info() # info about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [46]:
# You use only Pclass, Sex, Age, SibSp (Siblings aboard), Parch (Parents/children aboard),
# and Fare to predict whether a passenger survived.
titanic_df=titanic_df[['Pclass','Sex','Age','SibSp','Parch','Fare','Survived']] # independent dataset X
titanic_df.head() # printing first 5 tuples

   Pclass     Sex   Age  SibSp  Parch     Fare  Survived
0       3    male  22.0      1      0   7.2500         0
1       1  female  38.0      1      0  71.2833         1
2       3  female  26.0      0      0   7.9250         1
3       1  female  35.0      1      0  53.1000         1
4       3    male  35.0      0      0   8.0500         0

In [47]:
print("shape of the dataframe is ",titanic_df.shape) # shape of dataframe
(titanic_df.isnull().sum()/titanic_df.shape[0])*100 # percentage of null value per column

shape of the dataframe is  (891, 7)

Pclass       0.00000
Sex          0.00000
Age         19.86532
SibSp        0.00000
Parch        0.00000
Fare         0.00000
Survived     0.00000
dtype: float64

In [48]:
print("shape of dataframe before droping ",titanic_df.shape) # data frame shape before droping
titanic_df.dropna(inplace=True) # droping rows of data frame which have null values
print("shape of dataframe after droping ",titanic_df.shape) # data frame shape after droping

shape of dataframe before droping  (891, 7)
shape of dataframe after droping  (714, 7)

In [53]:
titanic_df['Sex']=titanic_df.Sex.map({'male':0,'female':1}) # encoding categorical variable in data frame with map() function

In [54]:
x=titanic_df.iloc[:,:-1] # dividng data into independent data sets
x.head()

   Pclass  Sex   Age  SibSp  Parch     Fare
0       3    0  22.0      1      0   7.2500
1       1    1  38.0      1      0  71.2833
2       3    1  26.0      0      0   7.9250
3       1    1  35.0      1      0  53.1000
4       3    0  35.0      0      0   8.0500

In [51]:
y=titanic_df['Survived'] # dividing data frame into dependent dataset y
y.head() # printing first 5 tuples

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [56]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=42) # train test split of the x and y datasets

In [57]:
print('shape of x_train is: ',x_train.shape)
print('shape of x_test is: ',x_test.shape)
print('shape of y_train is: ',y_train.shape)
print('shape of y_test is: ',y_test.shape)

shape of x_train is:  (571, 6)
shape of x_test is:  (143, 6)
shape of y_train is:  (571,)
shape of y_test is:  (143,)

In [63]:
from sklearn import tree # importing tree from sklearn

#execting loop 1-10 and for assigning i to max_depth and predicting accuarcy
for i in range(1,10):
    classifier = tree.DecisionTreeClassifier(criterion='gini',max_depth=i,random_state=42) # making object of tree classifier
    classifier.fit(x_train,y_train) # training the model on training set
    y_pred = classifier.predict(x_test) # predicting the value on test set
    acc_score=metrics.accuracy_score(y_test,y_pred) # checking accuracy score
    print("for max_depth = ",i,", accuracy is :",acc_score) # printing accuracy_score corresponding to each i

for max_depth =  1 , accuracy is : 0.7342657342657343
for max_depth =  2 , accuracy is : 0.7342657342657343
for max_depth =  3 , accuracy is : 0.7412587412587412
for max_depth =  4 , accuracy is : 0.7552447552447552
for max_depth =  5 , accuracy is : 0.7202797202797203
for max_depth =  6 , accuracy is : 0.7412587412587412
for max_depth =  7 , accuracy is : 0.7202797202797203
for max_depth =  8 , accuracy is : 0.7342657342657343
for max_depth =  9 , accuracy is : 0.7202797202797203

In [65]:
# since accuracy is best for depth of the tree equal to 4, so we will build the model
classifier = tree.DecisionTreeClassifier(criterion='gini',max_depth=4,random_state=42) # making object of tree classifier
classifier.fit(x_train,y_train) # training the model on training set
y_pred = classifier.predict(x_test) # predicting the value on test set
acc_score=metrics.accuracy_score(y_test,y_pred) # checking accuracy score

In [72]:
print(" accuracy of our decision tree is :",acc_score*100,"%")
print(100*"-")
print("for max_depth = 4, confusion matrix is :\n",metrics.confusion_matrix(y_test,y_pred)) # confusion matrix for the predicted value

 accuracy of our decision tree is : 75.52447552447552 %
----------------------------------------------------------------------------------------------------
for max_depth = 4, confusion matrix is :
 [[69 18]
 [17 39]]